#pragma once
#include <intrin.h>

#ifdef __cplusplus
#   define EXTERNC extern "C"
#else
#   define EXTERNC
#endif

#if defined(_M_MRX000) || defined(_M_ALPHA) || defined(_M_PPC) || defined(_M_IA64) || defined(_M_AMD64) || defined(_M_ARM) || defined(_M_ARM64)
#define ALIGNMENT_MACHINE
#define UNALIGNED __unaligned
#if defined(_WIN64)
#define UNALIGNED64 __unaligned
#else
#define UNALIGNED64
#endif
#else
#undef ALIGNMENT_MACHINE
#define UNALIGNED
#define UNALIGNED64
#endif

#if defined(_WIN64)
#define MAXIMUM_PROC_PER_GROUP 64
#else
#define MAXIMUM_PROC_PER_GROUP 32
#endif

#ifdef __has_builtin
#if __has_builtin(__builtin_offsetof)
#define FIELD_OFFSET(type, field)    ((LONG)__builtin_offsetof(type, field))
#define UFIELD_OFFSET(type, field)    ((DWORD)__builtin_offsetof(type, field))
#endif
#endif

#ifndef FIELD_OFFSET
#define FIELD_OFFSET(type, field)    ((LONG)(LONG_PTR)&(((type *)0)->field))
#define UFIELD_OFFSET(type, field)    ((DWORD)(LONG_PTR)&(((type *)0)->field))
#endif

#define _ARRAYSIZE(A) (sizeof(A)/sizeof((A)[0]))

#define MAXIMUM_PROCESSORS          MAXIMUM_PROC_PER_GROUP
#define MINCHAR     0x80        
#define MAXCHAR     0x7f        
#define MINSHORT    0x8000      
#define MAXSHORT    0x7fff      
#define MINLONG     0x80000000  
#define MAXLONG     0x7fffffff  
#define MAXBYTE     0xff        
#define MAXWORD     0xffff      
#define MAXDWORD    0xffffffff

//calling conventions

#define STATUS_ACCESS_VIOLATION           ((DWORD)0xC0000005L)    
#define STATUS_IN_PAGE_ERROR              ((DWORD)0xC0000006L)    
#define STATUS_INVALID_HANDLE             ((DWORD)0xC0000008L)    
#define STATUS_INVALID_PARAMETER          ((DWORD)0xC000000DL)    
#define STATUS_NO_MEMORY                  ((DWORD)0xC0000017L)    
#define STATUS_ILLEGAL_INSTRUCTION        ((DWORD)0xC000001DL)    
#define STATUS_NONCONTINUABLE_EXCEPTION   ((DWORD)0xC0000025L)    
#define STATUS_INVALID_DISPOSITION        ((DWORD)0xC0000026L)    
#define STATUS_ARRAY_BOUNDS_EXCEEDED      ((DWORD)0xC000008CL)    
#define STATUS_FLOAT_DENORMAL_OPERAND     ((DWORD)0xC000008DL)    
#define STATUS_FLOAT_DIVIDE_BY_ZERO       ((DWORD)0xC000008EL)    
#define STATUS_FLOAT_INEXACT_RESULT       ((DWORD)0xC000008FL)    
#define STATUS_FLOAT_INVALID_OPERATION    ((DWORD)0xC0000090L)    
#define STATUS_FLOAT_OVERFLOW             ((DWORD)0xC0000091L)    
#define STATUS_FLOAT_STACK_CHECK          ((DWORD)0xC0000092L)    
#define STATUS_FLOAT_UNDERFLOW            ((DWORD)0xC0000093L)    
#define STATUS_INTEGER_DIVIDE_BY_ZERO     ((DWORD)0xC0000094L)    
#define STATUS_INTEGER_OVERFLOW           ((DWORD)0xC0000095L)    
#define STATUS_PRIVILEGED_INSTRUCTION     ((DWORD)0xC0000096L)    
#define STATUS_STACK_OVERFLOW             ((DWORD)0xC00000FDL)    
#define STATUS_DLL_NOT_FOUND              ((DWORD)0xC0000135L)    
#define STATUS_ORDINAL_NOT_FOUND          ((DWORD)0xC0000138L)    
#define STATUS_ENTRYPOINT_NOT_FOUND       ((DWORD)0xC0000139L)    
#define STATUS_CONTROL_C_EXIT             ((DWORD)0xC000013AL)    
#define STATUS_DLL_INIT_FAILED            ((DWORD)0xC0000142L)    
#define STATUS_CONTROL_STACK_VIOLATION    ((DWORD)0xC00001B2L)    
#define STATUS_FLOAT_MULTIPLE_FAULTS      ((DWORD)0xC00002B4L)    
#define STATUS_FLOAT_MULTIPLE_TRAPS       ((DWORD)0xC00002B5L)    
#define STATUS_REG_NAT_CONSUMPTION        ((DWORD)0xC00002C9L)    
#define STATUS_HEAP_CORRUPTION            ((DWORD)0xC0000374L)    
#define STATUS_STACK_BUFFER_OVERRUN       ((DWORD)0xC0000409L)    
#define STATUS_INVALID_CRUNTIME_PARAMETER ((DWORD)0xC0000417L)    
#define STATUS_ASSERTION_FAILURE          ((DWORD)0xC0000420L)    
#define STATUS_ENCLAVE_VIOLATION          ((DWORD)0xC00004A2L)    
#define STATUS_INTERRUPTED                ((DWORD)0xC0000515L)    
#define STATUS_THREAD_NOT_RUNNING         ((DWORD)0xC0000516L)    
#define STATUS_ALREADY_REGISTERED         ((DWORD)0xC0000718L)

#define MAXIMUM_WAIT_OBJECTS 64
#define MAXIMUM_SUSPEND_COUNT MAXCHAR

#define NULL 0
#define bool  _Bool
#define false 0
#define true  1

#define TH32CS_INHERIT 0x80000000
#define TH32CS_SNAPHEAPLIST 0x00000001
#define TH32CS_SNAPMODULE 0x00000008
#define TH32CS_SNAPMODULE32 0x00000010
#define TH32CS_SNAPPROCESS 0x00000002
#define TH32CS_SNAPTHREAD 0x00000004
#define TH32CS_SNAPALL TH32CS_SNAPHEAPLIST | TH32CS_SNAPMODULE | TH32CS_SNAPPROCESS | TH32CS_SNAPTHREAD


typedef struct _LIST_ENTRY {
	struct _LIST_ENTRY* Flink;
	struct _LIST_ENTRY* Blink;
} LIST_ENTRY, * PLIST_ENTRY;

typedef struct _UNICODE_STRING {
	unsigned short	Length;
	unsigned short	MaximumLength;
	wchar_t* Buffer;
} UNICODE_STRING, * PUNICODE_STRING;

typedef struct _ACTIVATION_CONTEXT
{
	unsigned long       magic;
	int                 ref_count;
	//struct file_info    config;
	//struct file_info    appdir;
	struct assembly* assemblies;
	unsigned int        num_assemblies;
	unsigned int        allocated_assemblies;
	/* section data */
	unsigned long       sections;
	struct strsection_header* wndclass_section;
	struct strsection_header* dllredirect_section;
	struct strsection_header* progid_section;
	struct guidsection_header* tlib_section;
	struct guidsection_header* comserver_section;
	struct guidsection_header* ifaceps_section;
	struct guidsection_header* clrsurrogate_section;
} ACTIVATION_CONTEXT;

typedef struct _LDR_DATA_TABLE_ENTRY
{
	LIST_ENTRY			InLoadOrderLinks;				/* 0x00 */
	LIST_ENTRY			InMemoryOrderLinks;				/* 0x10 */
	LIST_ENTRY			InInitializationOrderLinks;		/* 0x20 */
	void* DllBase;						/* 0x30 */
	void* EntryPoint;						/* 0x38 */
	unsigned long		SizeOfImage;					/* 0x40 */
	UNICODE_STRING		FullDllName;					/* 0x48 */
	UNICODE_STRING		BaseDllName;					/* 0x58 */
	unsigned long Flags;
	unsigned short LoadCount;
	unsigned short TlsIndex;
	union
	{
		LIST_ENTRY HashLinks;
		struct
		{
			void* SectionPointer;
			unsigned long CheckSum;
		};
	};
	union
	{
		unsigned long TimeDateStamp;
		void* LoadedImports;
	};
	struct _ACTIVATION_CONTEXT* EntryPointActivationContext;
	void* PatchInformation;
	LIST_ENTRY ForwarderLinks;
	LIST_ENTRY ServiceTagLinks;
	LIST_ENTRY StaticLinks;
} LDR_DATA_TABLE_ENTRY, * PLDR_DATA_TABLE_ENTRY;

typedef struct _PEB_LDR_DATA
{
    ULONG Length;                                                           //0x0
    UCHAR Initialized;                                                      //0x4
    VOID* SsHandle;                                                         //0x8
    struct _LIST_ENTRY InLoadOrderModuleList;                               //0x10
    struct _LIST_ENTRY InMemoryOrderModuleList;                             //0x20
    struct _LIST_ENTRY InInitializationOrderModuleList;                     //0x30
    VOID* EntryInProgress;                                                  //0x40
    UCHAR ShutdownInProgress;                                               //0x48
    VOID* ShutdownThreadId;                                                 //0x50
} PEB_LDR_DATA, * PPEB_LDR_DATA;

typedef struct _PEB {
    UCHAR InheritedAddressSpace;                                            //0x0
    UCHAR ReadImageFileExecOptions;                                         //0x1
    UCHAR BeingDebugged;                                                    //0x2
    union
    {
        UCHAR BitField;                                                     //0x3
        struct
        {
            UCHAR ImageUsesLargePages : 1;                                    //0x3
            UCHAR IsProtectedProcess : 1;                                     //0x3
            UCHAR IsImageDynamicallyRelocated : 1;                            //0x3
            UCHAR SkipPatchingUser32Forwarders : 1;                           //0x3
            UCHAR IsPackagedProcess : 1;                                      //0x3
            UCHAR IsAppContainer : 1;                                         //0x3
            UCHAR IsProtectedProcessLight : 1;                                //0x3
            UCHAR IsLongPathAwareProcess : 1;                                 //0x3
        };
    };
    VOID* Mutant;                                                           //0x4
    VOID* ImageBaseAddress;                                                 //0x8
    struct _PEB_LDR_DATA* Ldr;                                              //0xc
} PEB, * PPEB;

typedef struct _TIB {
	unsigned char	Stuff[0x60];
	PPEB			pPEB;
} TIB, * PTIB;


typedef struct _IMAGE_DOS_HEADER {      // DOS .EXE header
    WORD   e_magic;                     // Magic number
    WORD   e_cblp;                      // Bytes on last page of file
    WORD   e_cp;                        // Pages in file
    WORD   e_crlc;                      // Relocations
    WORD   e_cparhdr;                   // Size of header in paragraphs
    WORD   e_minalloc;                  // Minimum extra paragraphs needed
    WORD   e_maxalloc;                  // Maximum extra paragraphs needed
    WORD   e_ss;                        // Initial (relative) SS value
    WORD   e_sp;                        // Initial SP value
    WORD   e_csum;                      // Checksum
    WORD   e_ip;                        // Initial IP value
